Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/housing_taxes_and_reliefs/paying_local_property_tax.html.txt.tmx
Source language: en
Languages: ga

source: If you are self-employed and fail to pay your LPT or Household Charge arrears, Revenue will not issue you with a tax clearance certificate
ga: Má tá tú féinfhostaithe agus má theipeann ort do CMÁ nó do riaráistí Muirear Teaghlaigh a íoc, ní eiseoidh na Coimisinéirí Ioncaim deimhniú imréiteach cánach duit

source: Read further information from Revenue on Household Charge arrears and information on 'Failure to meet LPT obligations'
ga: Léigh Ceisteanna Coitianta na gCoimisinéirí Ioncaim ar riaráistí an Mhuirir Theaghlaigh agus Faisnéis ar ‘Theip ar dhualgais CMÁ a chomhlíonadh’

source: You can log in to the LPT online system to view your Local Property Tax record and to pay arrears (using your PPS number, Property ID and PIN). Where to apply The Revenue Commissioners Local Property Tax (LPT) Branch P.O
ga: Féadfaidh tú logáil isteach sa chóras CMÁ ar líne chun féachaint ar do thaifead Cáin Mhaoine Áitiúil agus riaráistí a íoc (trí do UPSP, Aitheantas agus Uimhir Aitheantais Phearsanta do Mhaoine a úsáid)
